In [1]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import env

In [2]:
# reading csv file into pandas df
file = "https://gist.githubusercontent.com/ryanorsinger/14c8f919920e111f53c6d2c3a3af7e70/raw/07f6e8004fa171638d6d599cfbf0513f6f60b9e8/student_grades.csv"
df = pd.read_csv(file)

In [3]:
# preview
df.head()

   student_id  exam1  exam2 exam3  final_grade
0           1  100.0     90    95           96
1           2   98.0     93    96           95
2           3   85.0     83    87           87
3           4   83.0     80    86           85
4           5   93.0     90    96           97

In [4]:
# rows and columns
df.shape

(104, 5)

In [5]:
# summary stats
df.describe().T

             count       mean        std   min    25%   50%    75%    max
student_id   104.0  52.500000  30.166206   1.0  26.75  52.5  78.25  104.0
exam1        103.0  78.621359  14.260955  57.0  70.00  79.0  92.00  100.0
exam2        104.0  77.307692  10.295703  65.0  70.00  75.0  89.00   93.0
final_grade  104.0  81.692308  10.918122  65.0  72.00  81.0  93.00   97.0

In [7]:
# exam1 column has x1 null value
# exam3 values are objects
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   student_id   104 non-null    int64
 1   exam1        103 non-null    float64
 2   exam2        104 non-null    int64
 3   exam3        104 non-null    object
 4   final_grade  104 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 4.2+ KB

In [9]:
# looking at the null values
df.isnull().sum()

student_id     0
exam1          1
exam2          0
exam3          0
final_grade    0
dtype: int64

In [15]:
df[df.exam1.isnull()]

   student_id  exam1  exam2 exam3  final_grade
9          10    NaN     70    79           70

In [22]:
df.exam3.value_counts(ascending = True, dropna = False)

       1
94     8
86     8
95     8
85     8
79     8
70     8
87     8
75    15
96    16
78    16
Name: exam3, dtype: int64